Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: དེར་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཞིང་།
en: There you will attain the complete enlightenment of perfect buddhahood.

source: དེ་བཞིན་གཤེགས་པའི་མཚན་ཡང་མི་འཁྲུགས་པ་ཞེས་བྱ་བ་ཉིད་དུ་འགྱུར་ཏེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་འགྱུར་རོ། །མི་འཁྲུགས་པས་གསོལ་པ།
en: Thus you will be the tathāgata, and so on, up to and including the buddha bhagavat, named Akṣobhya.’ “

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་རེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན། དེའི་སླད་དུ་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ན་གང་དག་སེམས་ཅན་དུ་བསྡུ་བར་བསྡུས་པའི་སེམས་ཅན་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ཀྱིས་ཡོངས་སུ་ཟིན་པ་དེ་དག་ཐམས་ཅད་བྱམས་པའི་སེམས་དང་ལྡན་པར་གྱུར་ཅིག །ཁོ་ན་མ་མཆིས་པའི་སེམས་དང་།
en: Akṣobhya said, ‘Bhadanta Bhagavat, if this wish of mine is to be completely fulfilled, may the beings everywhere in all the world realms—who have taken possession of aggregates, sensory elements, and sensory bases, who are comprised as beings—all have loving minds, minds without enmity, and minds without impurity.

source: རྙོག་པ་མ་མཆིས་པའི་སེམས་སུ་གྱུར་ཅིག །དེ་དག་འདི་ལྟ་བུའི་ལུས་ཀྱིས་བདེ་བ་མྱོང་བར་གྱུར་ཅིག །
en: May they experience physical bliss.

source: འདི་ལྟ་སྟེ་དཔེར་བགྱི་ནས་བཅུ་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་པད་མ་ལ་སྙོམས་པར་ཞུགས་ཤིང་དེས་བསམ་པ་ལ་སྤོང་བ་རྣམ་པར་དག་པར་གྱུར་པ་དེ་ལྟ་བུར་སེམས་ཅན་རྣམས་ཀྱང་ལུས་དང་སེམས་ཀྱི་བདེ་བ་དང་ལྡན་པར་གྱུར་ཅིག །
en: May they be bestowed with mental and physical bliss like that of tenth-level bodhisattvas in the lotus samādhi, who have the purity of having relinquished thinking.

source: གང་གི་ཚེ་བདག་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཡན་ལག་ལྔས་ཕྱག་འཚལ་བ་དེའི་ཚེ་ས་གཞི་ཐམས་ཅད་གསེར་གྱི་ཁ་དོག་ལྟ་བུར་གདའ་བར་གྱུར་ཅིག །
en: When I bow down the five points of my body to the feet of the Bhagavat, may the entire earth become the color of gold.’ “

source: རིགས་ཀྱི་བུ་དེས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་ཡན་ལག་ལྔས་ཕྱག་བྱས་པ་དེའི་ཚེ་དེའི་དུས་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱང་ཇི་ལྟར་སྨོན་ལམ་བཏབ་པ་དེ་ལྟ་བུའི་བདེ་བ་དང་ལྡན་པར་གྱུར་པ་དེའི་ཚེ་ས་གཞི་ཐམས་ཅད་ཀྱང་གསེར་གྱི་ཁ་དོག་ལྟ་བུར་སྣང་བར་གྱུར་པ་དང་།
en: Noble son, when he bowed down the five points of his body to the feet of the Tathāgata Ratnagarbha, all beings were bestowed with the bliss he had prayed for, and at that time the entire earth was seen to be gold in color. “

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བཀའ་སྩལ་པ། བློ་གྲོས་རབ་མཆོག་སེམས་མི་འཁྲུགས་པ་ལོངས། །ལག་པའི་མཐིལ་ན་འཁོར་ལོ་མཆོག་རབ་གནས།
en: The Tathāgata Ratnagarbha said: “ ‘Rise up, Akṣobhya, you who have supreme intelligence, You who have formed perfect wheels on the palms of your hands.

source: །མི་རྣམས་མང་པོ་སྙིང་རྗེའི་སེམས་ལ་བཀོད། །བློ་གྲོས་དགེ་ཁྱོད་འགྲོ་བའི་སྟོན་པར་འགྱུར།
en: Having caused many humans to have compassionate minds, You who have splendid intelligence, you will be a teacher for the world.’ “

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་རྒྱལ་བུ་བཅུ་པ་གངས་ཀྱི་ནོར་བུ་ཞེས་བྱ་བ་ལ་སྔ་མ་བཞིན་དུ་སྦྱར་རོ།
en: Noble son, the brahmin Samudrareṇu then spoke to the tenth prince, who was named Himaṇi, and it proceeded as before.

source: །རྒྱལ་བུ་གངས་ཀྱི་ནོར་བུས་ཀྱང་ཇི་ལྟར་མི་འཁྲུགས་པས་སྨོན་ལམ་བཏབ་པ་དེ་བཞིན་དུ་སྨོན་ལམ་བཏབ་བོ།
en: Prince Himaṇi made the same kind of prayers that Akṣobhya had.

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་རེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན་དེའི་སླད་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་སངས་རྒྱས་ལ་དམིགས་པའི་ཡིད་ལ་བགྱིད་པ་ཐོབ་པར་གྱུར་ཅིག །ཐམས་ཅད་ཀྱི་སུག་པར་ཡང་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོའི་དྲི་འབྱུང་བར་གྱུར་ཅིག །དེ་དག་ཐམས་ཅད་ཀྱིས་དྲི་དེ་ཡང་སངས་རྒྱས་ཀྱི་སྐུ་དག་ལ་ཡོངས་སུ་བསྔོ་བར་གྱུར་ཅིག །
en: Then he said, ‘Bhadanta Bhagavat, if this wish of mine is to be completely fulfilled, may all beings see the Buddha in their minds, may there appear the fragrance of uragasāra sandalwood in their hands, and may they dedicate that fragrance to the body of the Buddha.’ “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་སྨོན་ལམ་རྒྱ་ཆེན་པོ་བཏབ་པ་ནི་ལེགས་སོ་ལེགས་སོ།
en: The Bhagavat said, ‘Excellent, excellent, noble son! Exalted are the prayers you have made!

source: །གང་ཁྱོད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལག་ཏུ་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོ་བཞག་པ་དང་། བསམ་པ་ཐག་པས་སངས་རྒྱས་ཡིད་ལ་བྱེད་པ་སྐྱེད་པས་ན་རིགས་ཀྱི་བུ་དེའི་ཕྱིར་ཁྱོད་སྤོས་ཀྱི་གླང་པོ་ཆེ་ཞེས་བྱ་བར་གྱུར་ཅིག །
en: Noble son, because you made all beings hold uragasāra sandalwood in their hands and caused their thoughts to be focused upon the Buddha, you will have the name Gandhahasti.

source: སྤོས་ཀྱི་གླང་པོ་ཆེ་ཁྱོད་ནི་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་འདས་ནས་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གཉིས་པ་ལ་བབ་པ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མི་འཁྲུགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཏེ། དམ་པའི་ཆོས་ནུབ་ནས་ཞག་བདུན་ལོན་པ་དང་། སྤོས་ཀྱི་གླང་པོ་ཆེ་ཁྱོད་འཇིག་རྟེན་གྱི་ཁམས་དེར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: Gandhahasti, after an incalculable eon has passed, in which there are as many years as there are grains of sand in the Ganges River, during a second such incalculable eon, in which there are as many years as there are grains of sand in the Ganges River, after the tathāgata arhat samyaksam­buddha Akṣobhya has passed into parinirvāṇa, and seven days after his good Dharma has disappeared, you, Gandhahasti, will attain the complete enlightenment of perfect buddhahood in that world realm.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་གྱི་མེ་ཏོག་ཅེས་བྱ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་འགྱུར་རོ།
en: There you will be the tathāgata arhat samyaksam­buddha, and so on, up to and including the bhagavat buddha, named Suvarṇapuṣpa.’ “

source: །སྤོས་ཀྱི་གླང་པོ་ཆེས་ཡང་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་རེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན་དེའི་སླད་དུ་གང་གི་ཚེ་བདག་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཡན་ལག་ལྔས་ཕྱག་འཚལ་བ་དེའི་ཚེ་ཀུན་དགའི་ར་བ་དེ་ཐམས་ཅད་དུ་མེ་ཏོག་ཙམ་པ་ཀའི་ཆར་རབ་ཏུ་འབབ་པར་གྱུར་ཅིག །རིགས་ཀྱི་བུ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སྤོས་ཀྱི་གླང་པོ་ཆེས།
en: Gandhahasti said, ‘Bhadanta Bhagavat, if this wish of mine is to be completely fulfilled, when I bow down the five points of my body to the feet of the Bhagavat, may a rain of magnolia flowers fall over the entire park.’ “

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་ཡན་ལག་ལྔས་ཕྱག་བྱས་པ་དེའི་ཚེ་ཀུན་དགའི་ར་བ་དེ་ཐམས་ཅད་དུ་མེ་ཏོག་ཙམ་པ་ཀའི་ཆར་མངོན་པར་རབ་ཏུ་བབ་པ་དང་། དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བཀའ་སྩལ་པ། ཤིན་ཏུ་དྲི་ཞིམ་ཚོགས་རབ་མཆོག་སེམས་ལོངས།
en: Noble son, when the bodhisattva Gandhahasti bowed down the five points of his body to the feet of the Tathāgata Ratnagarbha, a rain of magnolia flowers did fall over the entire park, and the Tathāgata Ratnagarbha said: “ ‘Rise up, you who have supreme qualities.

source: །མེ་ཏོག་ཙམ་པ་མཆོག་གི་ཆར་འདི་བབས།
en: Due to your fragrant mind, these exceptional magnolia flowers have rained down.

source: །རབ་ཏུ་གྱ་ནོམ་དགེ་བའི་ལམ་སྟོན་ལ། །འགྲོ་བ་མང་པོ་འཇིགས་མེད་སྒོར་འཁོད་ཅིག །
en: Show the auspicious path that is eminently sublime, And establish many beings on the fearless other shore.’ “

source: རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་རྒྱལ་བུ་བཅུ་གཅིག་པ་སེང་གེ་ཞེས་བྱ་བ་ལ་སྔ་མ་བཞིན་དུ་སྦྱར་རོ།
en: Noble son, the brahmin Samudrareṇu then spoke to the eleventh prince, who was named Siṃha, and it proceeded as before.

source: །ཇི་ལྟར་སྤོས་ཀྱི་གླང་པོ་ཆེས་སྨོན་ལམ་བཏབ་པ་བཞིན་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ལ་རིན་པོ་ཆེའི་རྒྱལ་མཚན་ཕུལ་བ་དང་།
en: Prince Siṃha made prayers like those of Gandhahasti, and then offered the Tathāgata Ratnagarbha a precious victory banner. “

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བཀའ་སྩལ་པ། སྐྱེས་བུ་དམ་པ་ལེགས་སོ་ལེགས་སོ།
en: The Tathāgata Ratnagarbha said, ‘Worthy being, excellent! Excellent!

source: །ཁྱོད་རིན་པོ་ཆེའི་ཏོག་ཅེས་བྱ་བར་གྱུར་ཅིག །
en: You should be named Ratnaketu!

source: རིན་པོ་ཆེའི་ཏོག་ཁྱོད་ནི་མ་འོངས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་འདས་ནས་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གཉིས་པ་ལ་བབ་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་མངོན་པར་དགའ་བ་ཞེས་བྱ་བ་དེར་དེ་བཞིན་གཤེགས་པ་གསེར་གྱི་མེ་ཏོག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཏེ། དེའི་དམ་པའི་ཆོས་ནུབ་ནས་བར་གྱི་བསྐལ་པ་གསུམ་འདས་པ་ན་སངས་རྒྱས་ཀྱི་ཞིང་དེ་རྒྱལ་བའི་ཟླ་བ་ཞེས་བྱ་བར་འགྱུར་རོ།
en: Ratnaketu, in the future, after an incalculable eon has passed, in which there are as many years as there are grains of sand in the Ganges River, during a second such incalculable eon, in which there are as many years as there are grains of sand in the Ganges River, after the Tathāgata Suvarṇapuṣpa has passed into parinirvāṇa in the Abhirati world realm and his good Dharma has disappeared, that buddha realm will be known as Jayasoma.

source: །དེར་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་གླང་པོ་རྣམ་པར་བསྒྲགས་པའི་དབང་ཕྱུག་དབྱངས་ཞེས་བྱ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་འགྱུར་རོ།
en: There you will attain the complete enlightenment of perfect buddhahood, and you will become the tathāgata, and so on, up to and including the buddha bhagavat, named Nāgavinarditeśvaraghoṣa.

source: །ཁྱོད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཅི་འདྲ་བ་དེ་ལྟ་བུར་འགྱུར་རོ།
en: Your buddha realm will have the same array of qualities as those of the Tathāgata Akṣobhya’s buddha realm.’ “

source: །རིན་པོ་ཆེའི་ཏོག་གིས་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་རེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན་དེའི་སླད་དུ་གང་གི་ཚེ་བདག་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་བ་དེའི་ཚེ། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་བྱང་ཆུབ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་དག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་སྙིང་རྗེ་ཞིང་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་དག་པར་ཞུགས་ཏེ། སླར་མི་ལྡོག་པར་འགྱུར་བ་དེ་ལྟ་བུའི་དྲན་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཐོབ་པར་གྱུར་ཅིག །
en: Ratnaketu said, ‘Bhadanta Bhagavat, if this wish of mine is to be completely fulfilled, then when I bow down to the feet of the Bhagavat, may all beings acquire the mindfulness of the bodhisattvas who have set out toward great enlightenment, who have compassionately set out toward complete enlightenment for the sake of all beings, and who will not turn back.’ “

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེའི་ཏོག་གིས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་ཕྱག་བྱས་པ་དང་། དེ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཀྱང་འདི་ལྟ་སྟེ། སེམས་ཅན་ཐམས་ཅད་སྙིང་རྗེའི་སེམས་ལ་བཀོད་པར་གྱུར་པ་དེ་ལྟ་བུའི་དྲན་པ་ཐོབ་པར་གྱུར་ཏོ།
en: Noble son, when the bodhisattva Ratnaketu thus bowed down to the feet of the Tathāgata Ratnagarbha, all beings acquired such mindfulness, that is, all beings were caused to have compassionate minds. “

source: །རིགས་ཀྱི་བུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེའི་ཏོག་ལ་བཀའ་སྩལ་པ། བློ་གྲོས་ལེགས་པ་གཟུགས་མཆོག་བརྟན་པ་ལོངས།
en: Then, noble son, the Tathāgata Ratnagarbha said to the bodhisattva Ratnaketu: “ ‘Rise up, steadfast one, you who have excellent intelligence and a supreme form.

source: །སེམས་ཅན་ཕྱིར་ནི་དམ་བཅས་རབ་བརྟན་བྱས།
en: You have made a firm commitment for the sake of beings.

source: །སྐྱེ་བོ་མང་པོ་རྡུལ་བྲལ་སེམས་ལ་བཞག །མི་མཆོག་སངས་རྒྱས་རབ་ཀྱི་མཆོག་ཏུ་འགྱུར།
en: You will establish many beings in a stainless mind; You will become supreme among men, a most eminent buddha.’ “

source: །དེ་ལྟར་སྔ་མ་བཞིན་དུ་སྦྱར་ཏེ། མཉན་དེས་ལ་སོགས་པ་རྒྱལ་བུ་ལྔ་བརྒྱས་ཀྱང་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་ཕྱག་རྒྱས་སྨོན་ལམ་བཏབ་ཅིང་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དག་ཡོངས་སུ་བླངས་པ་དེ་ལྟར་སྨོན་ལམ་བཏབ་ཅིང་།
en: Then, in the same way, five hundred princes, preceded by Mārdava, made prayers of aspiration and obtained arrays of qualities of a buddha realm just as the bodhisattva Gaganamudra had prayed and obtained arrays of qualities of a buddha realm.

source: དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཡོངས་སུ་བླངས་ནས་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་དུས་གཅིག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དང་གཞན་དག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་རེག་པར་འགྱུར་རོ།
en: The Tathāgata Ratnagarbha gave prophecies of the highest, complete enlightenment to them all, saying that at such a time, in this or that world realm, they would reach the highest, most complete enlightenment. “

source: །ཞེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ། །གཞན་ཡང་རྒྱལ་བུ་བཞི་བརྒྱས་ཀྱང་རྡོ་རྗེས་གཅོད་པ་ཤེས་རབ་སྣང་བའི་དཔལ་གྱིས་ཇི་ལྟ་བུ་དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དག་ཡོངས་སུ་བླངས་ནས་དེ་དག་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དང་གཞན་དག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ།
en: Another four hundred princes chose the array of buddha-realm qualities that Vajraccheda­prajñā­vabhāsaśrī had prayed for, and the Tathāgata Ratnagarbha gave prophecies to them all too, saying that in this or that world realm, they would reach the highest, most complete enlightenment. “

source: །གཞན་ཡང་རྒྱལ་བུ་དགུ་བཅུས་ཀྱང་ཀུན་ཏུ་བཟང་པོས་ཇི་ལྟ་བ་དེ་ལྟ་བུའི་སྨོན་ལམ་བཏབ་ཅིང་དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་བླངས་སོ།
en: Another ninety princes chose buddha realms like those Samantabhadra had prayed for.

source: །ཁམས་ཀྱི་རྒྱལ་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ་ཐམས་ཅད་ཀྱིས་ཀྱང་སོ་སོ་ནས་སྨོན་ལམ་ཁྱད་པར་ཅན་དག་བཏབ་ཅིང་།
en: Also, each of the 84,000 minor kings all made their own specific prayers of aspiration.

source: སོ་སོ་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དག་ཡོངས་སུ་བླངས་ནས་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་དུས་གཅིག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དང་གཞན་དག་ཏུ་བྱང་ཆུབ་ཐོབ་པར་འགྱུར་རོ་ཞེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ།
en: Each one chose an array of buddha-realm qualities, and the Tathāgata Ratnagarbha gave prophecies to them all too, saying that at such-and-such a time, in this or that world realm, they would reach the highest, most complete enlightenment. “

source: །དེ་བཞིན་དུ་སྲོག་ཆགས་དུང་ཕྱུར་ཕྲག་དགུ་དང་། བྱེ་བ་ཕྲག་གཉིས་ཀྱིས་ཀྱང་སོ་སོ་ནས་སྨོན་ལམ་བཏབ་ཅིང་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དག་ཀྱང་ཡོངས་སུ་བླངས་ནས་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་དེ་བཞིན་དུ་ཁྱོད་ཅག་ཀྱང་དུས་གཅིག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དང་གཞན་དག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །ཞེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ།
en: In that same way, 920,000,000 beings each made their own specific prayers of aspiration and chose an array of buddha-realm qualities, and the Tathāgata Ratnagarbha prophesied to them all too, saying that at such-and-such a time, in this or that world, they would reach the highest, most complete enlightenment. “

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱི་བུ་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་གཅེན་གཅུང་པོ་བརྒྱད་ཅུ་པོ་དེ་དག་གི་ཐུ་བོ་བྲམ་ཟེའི་ཁྱེའུ་རྒྱ་མཚོའི་དབང་ཕྱུག་ཁྱབ་བདག་ཅེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: Noble son, among the eighty sons of the brahmin Samudrareṇu, the brothers of the Tathāgata Ratnagarbha, the oldest was a brahmin youth named Samudreśvarabhuvi.

source: རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་བྲམ་ཟེའི་ཁྱེའུ་རྒྱ་མཚོའི་དབང་ཕྱུག་ཁྱབ་བདག་ལ་སྨྲས་པ། བྲམ་ཟེའི་ཁྱེའུ་ཁྱེད་ཀྱིས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཡོངས་སུ་དག་པ་ཡོངས་སུ་ལོངས་ཤིག །
en: The brahmin Samudrareṇu said to the brahmin youth Samudreśvarabhuvi, ‘Young brahmin, you too should choose a pure array of buddha-realm qualities.’ “

source: བྲམ་ཟེའི་ཁྱེའུ་རྒྱ་མཚོའི་དབང་ཕྱུག་ཁྱབ་བདག་གིས་སྨྲས་པ། ཡབ་ཇེ་ཁྱོད་ཀྱིས་སེང་གེའི་སྒྲ་སྒྲོགས་ཤིག །
en: The young brahmin Samudreśvarabhuvi answered, ‘Father, you should be first to make that lion’s roar.’ “ ‘

source: རྒྱ་མཚོའི་རྡུལ་གྱིས་སྨྲས་པ། བུ་ཇེ་ཁྱོད་ཀྱིས་སྨོན་ལམ་ཐོབ་ཤིག་དང་ཁོ་བོས་ཕྱིས་སྨོན་ལམ་གདབ་པར་བྱའོ། །དེས་སྨྲས་པ།
en: Son,’ said Samudrareṇu, ‘you make an aspirational prayer, and I will make an aspirational prayer after you.’ “

source: ཡབ་ཅིག་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ཡོངས་སུ་བླང་བར་བགྱི་ལགས་སམ། འོན་ཏམ་ཡོངས་སུ་མ་དག་པ་བླང་བར་བགྱི་ལགས། མདུན་ན་འདོན་གྱི་གཙོ་བོས་སྨྲས་པ།
en: Then he asked, ‘Father, do you think I should choose a pure buddha realm or an impure buddha realm?’ “

source: བྲམ་ཟེའི་ཁྱེའུ་གང་དག་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཉོན་མོངས་པ་ཅན་ཡོངས་སུ་ལེན་པར་བྱེད་ཅིང་སེམས་ཅན་བསམ་པ་ཉོན་མོངས་པ་ཅན་ལྟ་བ་ལོག་པར་གྱུར་པ་དག་འདུལ་བ་ཡང་ཡོངས་སུ་ལེན་པར་བྱེད་པས་ཁྱོད་བདག་རང་གིས་ཤེས་པར་གྱིས་ཤིག །
en: The royal priest replied, ‘Young brahmin, the bodhisattvas who have great compassion choose an afflicted buddha realm; they decide to guide beings with afflicted thoughts and mistaken views. As for you, you should decide for yourself.’ “

source: རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་རྒྱ་མཚོའི་དབང་ཕྱུག་ཁྱབ་བདག་དེ་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་པ་དང་། དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་སྤྱན་སྔར་འདུག་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ནི་སྐྱེ་དགུ་ལོ་བརྒྱད་ཁྲི་ཐུབ་པ་ན་བྱང་ཆུབ་དམ་པ་ལ་རེག་པར་གྱུར་པ་དེ་ལྟ་བུར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བཙལ་ལགས་ཏེ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ད་ལྟར་གྱི་སེམས་ཅན་རྣམས་འདོད་ཆགས་ཆུང་བ་དང་།
en: Noble son, the young brahmin Samudreśvarabhuvi went to where the Tathāgata Ratnagarbha was, sat before the Tathāgata Ratnagarbha, and said these words: ‘Bhadanta Bhagavat, I wish to attain the highest, most complete enlightenment when beings live for eighty thousand years.

source: ཞེ་སྡང་ཆུང་བ་དང་། གཏི་མུག་ཆུང་བ་དང་། སྐྱོ་བའི་བསམ་པ་ཅན་དང་། འཁོར་བ་ལ་འཇིགས་པ་དང་། སྐྱོན་དུ་ལྟ་བ་དེ་ལྟར་གང་དུ་བདག་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་རྣམས་ཀྱང་དེ་ལྟ་བུར་གྱུར་ཅིག །
en: Bhagavat, may the beings in the buddha realm where I attain complete enlightenment be like beings in this present time who have little desire, little anger, little ignorance, sorrowful thoughts, and who see the dangers and faults in saṃsāra.

source: དེ་དག་ཀྱང་བདག་ལས་རབ་ཏུ་འབྱུང་བར་འགྱུར་ཞིང་།
en: May they take ordination from me.

source: བདག་ཀྱང་སེམས་ཅན་རྣམས་ལ་ཐེག་པ་གསུམ་པོ་དག་གིས་ཆོས་སྟོན་པར་གྱུར་ཅིག །
en: May I teach the Dharma to those beings by the three yānas.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་རེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན། དེའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་དུ་གསོལ། །དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བཀའ་སྩལ་པ།
en: Bhadanta Bhagavat, if this wish of mine is to be completely fulfilled, then I pray that the Bhagavat give me the prophecy of my attainment of the highest, most complete enlightenment.’ “

source: བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་ནི་མ་འོངས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་འདས་ནས་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གཉིས་པ་ལ་བབ་པ་ན་བསྐལ་པ་ཨུད་པ་ལ་ཡང་དག་རྟོག་ཅེས་བྱ་བ་ལ།
en: The Tathāgata Ratnagarbha said, ‘Young brahmin, in the future, after an incalculable eon has passed, in which there are as many years as there are grains of sand in the Ganges River, during a second such incalculable eon, in which there are as many years as there are grains of sand in the Ganges River, there will be the Utpalasaṃtīraṇa eon in which there will be a four-continent world called Baliṣṭhā.

source: སངས་རྒྱས་ཀྱི་ཞིང་འདིའི་གླིང་བཞི་པ་མཆོག་ཅེས་བྱ་བར་འགྱུར་ཞིང་སྐྱེ་དགུའི་ལོ་བརྒྱད་ཁྲི་ཐུབ་པ་ན་བྱང་ཆུབ་མངོན་པར་ཐོབ་པར་འགྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེ་བརྩེགས་པ་ཞེས་བྱ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་འགྱུར་རོ།
en: In this buddha realm, where beings live for eighty thousand years, you will attain enlightenment and you will become the tathāgata, and so on, up to and including the bhagavat buddha, named Ratnakūṭa.’ “

source: །དེས་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་རེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན་དེའི་སླད་དུ་ཀུན་དགའི་ར་བ་འདི་ཐམས་ཅད་དུ་མུ་ཏིག་དམར་པོའི་ཆར་དག་རབ་ཏུ་འབབ་པར་གྱུར་ཅིག །ཤིང་ལྗོན་པ་ཐམས་ཅད་ལས་ཀྱང་ཡན་ལག་ལྔ་དང་ལྡན་པའི་སིལ་སྙན་གྱི་སྒྲ་དག་འབྱུང་བར་གྱུར་ཅིག །
en: He said, ‘Bhadanta Bhagavat, if this wish of mine is to be completely fulfilled, then may there be a rainfall of red pearls over this entire park, and may all the trees emit music with the five tempos.’ “

source: རིགས་ཀྱི་བུ་གང་གི་ཚེ་བྲམ་ཟེའི་ཁྱེའུ་རྒྱ་མཚོའི་དབང་ཕྱུག་ཁྱབ་བདག་གིས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་ཡན་ལག་ལྔས་ཕྱག་བྱས་པ་དེའི་ཚེ་ཀུན་དགའི་ར་བ་དེ་ཐམས་ཅད་དུ་མུ་ཏིག་དམར་པོའི་ཆར་དག་ཀྱང་རབ་ཏུ་བབ། ཤིང་ལྗོན་པ་དེ་ཐམས་ཅད་ལས་ཀྱང་ཡན་ལག་ལྔ་དང་ལྡན་པའི་སིལ་སྙན་གྱི་སྒྲ་དག་བྱུང་བ་དང་།
en: Noble son, when the young brahmin Samudreśvarabhuvi bowed down the five points of his body to the feet of the Tathāgata Ratnagarbha, there was a rainfall of red pearls over the entire park, and all the trees emitted music with the five tempos. “

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བཀའ་སྩལ་པ། མཐུ་མཆོག་མི་ཟད་ཤེས་རབ་མཛོད་ལོངས་ཤིག །
en: The Tāthagata Ratnagarbha said: “ ‘Rise up, you who have supreme power and an inexhaustible treasure of wisdom.

source: སེམས་ཅན་སྙིང་བརྩེ་ཕན་འདོད་བྱམས་པའི་སེམས།
en: You have compassion for beings, wishing for their welfare, and have a loving mind.

source: །ཁྱོད་ཀྱི་བསམ་པ་དག་པ་རྫོགས་འགྱུར་ཏེ།
en: Your pure intentions will be completely fulfilled.

source: །འཇིག་རྟེན་སེམས་ཅན་དོན་མཛད་སངས་རྒྱས་འགྱུར།
en: You will become a buddha in the world, one who benefits beings.’ “

source: །བྲམ་ཟེའི་བུ་གཉིས་པ་ཡང་དག་འབྱུང་ཞེས་བྱ་བ་དེས་ཀྱང་རྒྱ་མཚོའི་དབང་ཕྱུག་ཁྱབ་བདག་གིས་ཇི་ལྟ་བ་དེ་བཞིན་དུ་གསོལ་པ་དང་།
en: The brahmin’s second son was named Saṃbhava, who spoke just as Samudreśvarabhuvi.

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བཀའ་སྩལ་པ། བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་ཀྱང་བསྐལ་པ་ཨུད་པ་ལ་ཡང་དག་རྟོག་ལ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་མཆོག་ཅེས་བྱ་བར་འགྱུར་ཞིང་སྐྱེ་དགུའི་ལོ་བརྒྱད་ཁྲིར་འཕེལ་བ་ན་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་མེ་ཏོག་ཅེས་བྱ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་འགྱུར་རོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: The Tathāgata Ratnagarbha said, ‘Young brahmin, in the Utpalasaṃtīraṇa eon in the four-continent world realm called Baliṣṭhā, when beings live for eighty thousand years, you will become the tāthagata, and so on, up to and including the bhagavat buddha, named Vairocanakusuma.’ “

source: གསུམ་པས་ཀྱང་གསོལ་པ་དང་།
en: In the same way, the third son spoke.

source: ལོ་ཉིས་སྟོང་པ་ན་སྐར་མའི་དྲི་ཞེས་བྱ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་འགྱུར་རོ་ཞེས་ལུང་བསྟན་ཏོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ། འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་སྣ་མའི་མེ་ཏོག་དང་། རི་བོའི་རྒྱལ་པོ་དང་། སྤྱན་བསྡམས་དང་། ཚངས་མཆོག་དང་། འཛམ་བུའི་གྲིབ་མ་དང་། གང་བ་དང་། བླ་མ་དང་། རིན་ཆེན་རི་བོ་དང་། རྒྱ་མཚོའི་སྙིང་པོ་དང་། སྲེད་མེད་ཀྱི་བུ་དང་། གཙུག་ཏོར་ཅན་དང་། གསེར་ཐུབ་དང་། ཐུབ་དབང་དང་། ཀཽཎྜི་ནྱ་དང་། སེང་གེའི་རྩལ་དང་། ཡེ་ཤེས་རྒྱལ་མཚན་དང་། སངས་རྒྱས་སྒྲོགས་དང་། གཞན་གྱིས་མི་ཐུབ་པ་དང་། རྒྱས་པ་དང་། རྒྱལ་བ་དང་། ཕན་བཞེད་དང་། ཤེས་རབ་སྣང་དང་། དབང་ཆེན་དང་། ཞི་བ་དང་། ཤེས་རབ་འབྱུང་གནས་དང་། དགའ་བ་དང་། ནྱ་གྲོ་དྷ་རྒྱལ་པོ་དང་། གསེར་སྤྱན་དང་། ཕན་བཅས་དང་། གཉི་དགའ་དང་། རིན་ཆེན་གཙུག་ཏོར་ཅན་དང་། སྤྱན་བཟངས་དང་། ཚངས་པ་དང་། མཛེས་པ་དང་། ཚངས་པ་ཁྱུ་མཆོག་དང་། སྒྲ་རབ་དང་། ཆོས་ཀྱི་ཟླ་བ་དང་། དོན་མཐོང་དང་། སྙན་པ་དང་། དགའ་ཅན་དང་། གྲགས་མཆོག་དང་། གཟུགས་བཟང་དང་། དྲི་ཞིམ་དང་། གྲིམས་གཡར་དང་། རབ་མཆོག་སྤྱན་དང་། རབ་སྤོང་དང་། དོན་བཅས་བརྟུལ་ཞུགས་དང་། ཐུགས་ཀྱི་རེ་བ་བཟང་དང་། ཤེས་རབ་མཆོག་དང་། གསེར་གྱི་རྒྱལ་མཚན་དང་། སྤྱན་མཛེས་དང་། དག་པའི་ལྷ་དང་། ཟས་གཙང་དང་། ལེགས་མཐོང་ལྷ་དང་། འཕགས་སྐྱེས་རྒྱལ་མཚན་དང་། མིག་མི་བཟང་དང་། ཚངས་དབྱངས་དང་། དཔལ་འབྱུང་དང་། ང་རྒྱལ་དཔལ་དང་།
en: The Tathāgata Ratnagarbha prophesied, ‘When beings live for two thousand years, you will become the tāthagata, and so on, up to and including the bhagavat buddha, named Jyotigandha.’ “
